{"format": "layers-model", "generatedBy": "keras v2.3.0-tf", "convertedBy": "TensorFlow.js Converter v2.0.1.post1", "modelTopology": {"keras_version": "2.3.0-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_3"}, "name": "input_3", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "block1_conv1", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1_conv1", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block1_conv2", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1_conv2", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block1_pool", "trainable": false, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "block1_pool", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2_conv1", "trainable": false, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2_conv1", "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2_conv2", "trainable": false, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2_conv2", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block2_pool", "trainable": false, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "block2_pool", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3_conv1", "trainable": false, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3_conv1", "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3_conv2", "trainable": false, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3_conv2", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3_conv3", "trainable": false, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3_conv3", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3_conv4", "trainable": false, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3_conv4", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block3_pool", "trainable": false, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "block3_pool", "inbound_nodes": [[["block3_conv4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4_conv1", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4_conv1", "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block4_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block4_bn1", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4_conv2", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4_conv2", "inbound_nodes": [[["block4_bn1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block4_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block4_bn2", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4_conv3", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4_conv3", "inbound_nodes": [[["block4_bn2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block4_bn3", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block4_bn3", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4_conv4", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4_conv4", "inbound_nodes": [[["block4_bn3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block4_pool", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "block4_pool", "inbound_nodes": [[["block4_conv4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block5_conv1", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block5_conv1", "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block5_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block5_bn1", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block5_conv2", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block5_conv2", "inbound_nodes": [[["block5_bn1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block5_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block5_bn2", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block5_conv3", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block5_conv3", "inbound_nodes": [[["block5_bn2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block5_bn3", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block5_bn3", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block5_conv4", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block5_conv4", "inbound_nodes": [[["block5_bn3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block5_pool", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "block5_pool", "inbound_nodes": [[["block5_conv4", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten", "inbound_nodes": [[["block5_pool", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "fc1", "trainable": true, "dtype": "float32", "units": 4096, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fc1", "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.7, "noise_shape": null, "seed": null}, "name": "dropout_1", "inbound_nodes": [[["fc1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "fc2", "trainable": true, "dtype": "float32", "units": 1000, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fc2", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.7, "noise_shape": null, "seed": null}, "name": "dropout_2", "inbound_nodes": [[["fc2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "fc3", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fc3", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_3", "inbound_nodes": [[["fc3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "predictions", "trainable": true, "dtype": "float32", "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "predictions", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}], "input_layers": [["input_3", 0, 0]], "output_layers": [["predictions", 0, 0]]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": ["accuracy"], "weighted_metrics": null, "loss_weights": null, "sample_weight_mode": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0001, "decay": 0.0, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of152.bin", "group1-shard2of152.bin", "group1-shard3of152.bin", "group1-shard4of152.bin", "group1-shard5of152.bin", "group1-shard6of152.bin", "group1-shard7of152.bin", "group1-shard8of152.bin", "group1-shard9of152.bin", "group1-shard10of152.bin", "group1-shard11of152.bin", "group1-shard12of152.bin", "group1-shard13of152.bin", "group1-shard14of152.bin", "group1-shard15of152.bin", "group1-shard16of152.bin", "group1-shard17of152.bin", "group1-shard18of152.bin", "group1-shard19of152.bin", "group1-shard20of152.bin", "group1-shard21of152.bin", "group1-shard22of152.bin", "group1-shard23of152.bin", "group1-shard24of152.bin", "group1-shard25of152.bin", "group1-shard26of152.bin", "group1-shard27of152.bin", "group1-shard28of152.bin", "group1-shard29of152.bin", "group1-shard30of152.bin", "group1-shard31of152.bin", "group1-shard32of152.bin", "group1-shard33of152.bin", "group1-shard34of152.bin", "group1-shard35of152.bin", "group1-shard36of152.bin", "group1-shard37of152.bin", "group1-shard38of152.bin", "group1-shard39of152.bin", "group1-shard40of152.bin", "group1-shard41of152.bin", "group1-shard42of152.bin", "group1-shard43of152.bin", "group1-shard44of152.bin", "group1-shard45of152.bin", "group1-shard46of152.bin", "group1-shard47of152.bin", "group1-shard48of152.bin", "group1-shard49of152.bin", "group1-shard50of152.bin", "group1-shard51of152.bin", "group1-shard52of152.bin", "group1-shard53of152.bin", "group1-shard54of152.bin", "group1-shard55of152.bin", "group1-shard56of152.bin", "group1-shard57of152.bin", "group1-shard58of152.bin", "group1-shard59of152.bin", "group1-shard60of152.bin", "group1-shard61of152.bin", "group1-shard62of152.bin", "group1-shard63of152.bin", "group1-shard64of152.bin", "group1-shard65of152.bin", "group1-shard66of152.bin", "group1-shard67of152.bin", "group1-shard68of152.bin", "group1-shard69of152.bin", "group1-shard70of152.bin", "group1-shard71of152.bin", "group1-shard72of152.bin", "group1-shard73of152.bin", "group1-shard74of152.bin", "group1-shard75of152.bin", "group1-shard76of152.bin", "group1-shard77of152.bin", "group1-shard78of152.bin", "group1-shard79of152.bin", "group1-shard80of152.bin", "group1-shard81of152.bin", "group1-shard82of152.bin", "group1-shard83of152.bin", "group1-shard84of152.bin", "group1-shard85of152.bin", "group1-shard86of152.bin", "group1-shard87of152.bin", "group1-shard88of152.bin", "group1-shard89of152.bin", "group1-shard90of152.bin", "group1-shard91of152.bin", "group1-shard92of152.bin", "group1-shard93of152.bin", "group1-shard94of152.bin", "group1-shard95of152.bin", "group1-shard96of152.bin", "group1-shard97of152.bin", "group1-shard98of152.bin", "group1-shard99of152.bin", "group1-shard100of152.bin", "group1-shard101of152.bin", "group1-shard102of152.bin", "group1-shard103of152.bin", "group1-shard104of152.bin", "group1-shard105of152.bin", "group1-shard106of152.bin", "group1-shard107of152.bin", "group1-shard108of152.bin", "group1-shard109of152.bin", "group1-shard110of152.bin", "group1-shard111of152.bin", "group1-shard112of152.bin", "group1-shard113of152.bin", "group1-shard114of152.bin", "group1-shard115of152.bin", "group1-shard116of152.bin", "group1-shard117of152.bin", "group1-shard118of152.bin", "group1-shard119of152.bin", "group1-shard120of152.bin", "group1-shard121of152.bin", "group1-shard122of152.bin", "group1-shard123of152.bin", "group1-shard124of152.bin", "group1-shard125of152.bin", "group1-shard126of152.bin", "group1-shard127of152.bin", "group1-shard128of152.bin", "group1-shard129of152.bin", "group1-shard130of152.bin", "group1-shard131of152.bin", "group1-shard132of152.bin", "group1-shard133of152.bin", "group1-shard134of152.bin", "group1-shard135of152.bin", "group1-shard136of152.bin", "group1-shard137of152.bin", "group1-shard138of152.bin", "group1-shard139of152.bin", "group1-shard140of152.bin", "group1-shard141of152.bin", "group1-shard142of152.bin", "group1-shard143of152.bin", "group1-shard144of152.bin", "group1-shard145of152.bin", "group1-shard146of152.bin", "group1-shard147of152.bin", "group1-shard148of152.bin", "group1-shard149of152.bin", "group1-shard150of152.bin", "group1-shard151of152.bin", "group1-shard152of152.bin"], "weights": [{"name": "block1_conv1_2/kernel", "shape": [3, 3, 3, 64], "dtype": "float32"}, {"name": "block1_conv1_2/bias", "shape": [64], "dtype": "float32"}, {"name": "block1_conv2_2/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "block1_conv2_2/bias", "shape": [64], "dtype": "float32"}, {"name": "block2_conv1_2/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "block2_conv1_2/bias", "shape": [128], "dtype": "float32"}, {"name": "block2_conv2_2/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "block2_conv2_2/bias", "shape": [128], "dtype": "float32"}, {"name": "block3_conv1_2/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "block3_conv1_2/bias", "shape": [256], "dtype": "float32"}, {"name": "block3_conv2_2/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "block3_conv2_2/bias", "shape": [256], "dtype": "float32"}, {"name": "block3_conv3_2/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "block3_conv3_2/bias", "shape": [256], "dtype": "float32"}, {"name": "block3_conv4_2/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "block3_conv4_2/bias", "shape": [256], "dtype": "float32"}, {"name": "block4_bn1/gamma", "shape": [512], "dtype": "float32"}, {"name": "block4_bn1/beta", "shape": [512], "dtype": "float32"}, {"name": "block4_bn1/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "block4_bn1/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "block4_bn2/gamma", "shape": [512], "dtype": "float32"}, {"name": "block4_bn2/beta", "shape": [512], "dtype": "float32"}, {"name": "block4_bn2/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "block4_bn2/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "block4_bn3/gamma", "shape": [512], "dtype": "float32"}, {"name": "block4_bn3/beta", "shape": [512], "dtype": "float32"}, {"name": "block4_bn3/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "block4_bn3/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "block4_conv1_2/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "block4_conv1_2/bias", "shape": [512], "dtype": "float32"}, {"name": "block4_conv2_2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block4_conv2_2/bias", "shape": [512], "dtype": "float32"}, {"name": "block4_conv3_2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block4_conv3_2/bias", "shape": [512], "dtype": "float32"}, {"name": "block4_conv4_2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block4_conv4_2/bias", "shape": [512], "dtype": "float32"}, {"name": "block5_bn1/gamma", "shape": [512], "dtype": "float32"}, {"name": "block5_bn1/beta", "shape": [512], "dtype": "float32"}, {"name": "block5_bn1/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "block5_bn1/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "block5_bn2/gamma", "shape": [512], "dtype": "float32"}, {"name": "block5_bn2/beta", "shape": [512], "dtype": "float32"}, {"name": "block5_bn2/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "block5_bn2/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "block5_bn3/gamma", "shape": [512], "dtype": "float32"}, {"name": "block5_bn3/beta", "shape": [512], "dtype": "float32"}, {"name": "block5_bn3/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "block5_bn3/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "block5_conv1_2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block5_conv1_2/bias", "shape": [512], "dtype": "float32"}, {"name": "block5_conv2_2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block5_conv2_2/bias", "shape": [512], "dtype": "float32"}, {"name": "block5_conv3_2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block5_conv3_2/bias", "shape": [512], "dtype": "float32"}, {"name": "block5_conv4_2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block5_conv4_2/bias", "shape": [512], "dtype": "float32"}, {"name": "fc1/kernel", "shape": [32768, 4096], "dtype": "float32"}, {"name": "fc1/bias", "shape": [4096], "dtype": "float32"}, {"name": "fc2/kernel", "shape": [4096, 1000], "dtype": "float32"}, {"name": "fc2/bias", "shape": [1000], "dtype": "float32"}, {"name": "fc3/kernel", "shape": [1000, 512], "dtype": "float32"}, {"name": "fc3/bias", "shape": [512], "dtype": "float32"}, {"name": "predictions/kernel", "shape": [512, 3], "dtype": "float32"}, {"name": "predictions/bias", "shape": [3], "dtype": "float32"}]}]}